* User

  #+name: user-query
  #+header: :engine mysql
  #+header: :dbhost trashpanda-team.ddns.net
  #+header: :dbuser root
  #+header: :dbport 3307
  #+header: :dbpassword misiePysie69
  #+header: :database jarman
  #+begin_src sql
    -- SELECT * FROM permission
    SELECT
    user.id AS `user.id`,
    user.login AS `user.login`,
    user.password AS `user.password`,
    user.last_name AS `user.last_name`,
    user.first_name AS `user.first_name`,
    user.id_profile AS `user.id_profile`,
    user.configuration AS `user.configuration`
    -- profile.name AS `profile.name`
    -- profile.configuration AS `profile.configuration`
    FROM `user`
    INNER JOIN `profile` ON `user`.`id_profile`=`profile`.`id`;
  #+end_src
  #+RESULTS: user-query
  | user.id | user.login | user.password | user.last_name | user.first_name | user.id_profile | user.configuration                                                          |
  |---------+------------+---------------+----------------+-----------------+-----------------+-----------------------------------------------------------------------------|
  |       1 | admin      | admin         | admin          | admin           |               1 | {:ftp {:login "jarman", :password "dupa" :host "trashpanda-team.ddns.net"}} |
  |       2 | dev        | dev           | dev            | dev             |               3 | {:ftp {:login "jarman", :password "dupa" :host "trashpanda-team.ddns.net"}} |
  |       3 | user       | user          | user           | user            |               2 | {:ftp {:login "jarman", :password "dupa" :host "trashpanda-team.ddns.net"}} |

  Create users, and profiles
  #+name: user-raw
  #+begin_src emacs-lisp :var elist=user-query :results value silent
    (prin1-to-string elist)
  #+end_src
  #+begin_src clojure :var elist=user-raw :results output
    (def user-config
      (pr-str
       (get {:dev
	     {:ftp {:login "jarman"
		    :password "dupa"
		    :host "trashpanda-team.ddns.net"}}} :dev {})))
    
    (defn update-users []
      (for [[id login password lname fname id_prof cfg] (read-string elist)]
	(if-let [existing-profile (first (db/query (select! {:table_name :user :where [:= :id id]})))]
	  (db/exec (update! {:table_name :user
			     :set {:user.login login
				   :user.password password,
				   :user.last_name lname,
				   :user.first_name fname,
				   :user.id_profile id_prof
				   :user.configuration user-config} :where [:= :user.id id]}))
	  (db/exec (insert! {:table_name :user
			     :column-list [:login :password :first_name :last_name :id_profile :configuration]
			     :values [[login password lname fname id_prof cfg]]})))))
    
    (time
     (do
       (println "create users")
       (update-users)))
  #+end_src
  #+begin_src clojure :ns ekka.fish :results value :hlines yes
    (map vals (db/query (select! {:table_name :user})))
  #+end_src
  
